src/toir_cf/src/Catalogs/торо_СобытияУведомленийВДокументах/торо_СобытияУведомленийВДокументах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СобытияУведомленийВДокументах</name>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.торо_ШаблоныСообщенийИУведомлений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьВсплывающиеУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьПочтовыеУведомления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПолучателейПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПолучателейПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оповещаемые</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отбор</name>
    <attributes>
      <name>НаименованиеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_родителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/торо_СобытияУведомленийВДокументах/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// ТЧ Пользователи
	Для Каждого ТекущиеДанные Из Объект.Оповещаемые Цикл		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Пользователь) Тогда
		    ТекстСообщения = НСтр("ru = 'Обнаружено незаполненное поле ""Пользователь"" в таблице ""Оповещаемые лица""!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Оповещаемые",, Отказ);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если Объект.РазделятьПолучателейПоОрганизациям И Объект.РазделятьПолучателейПоОрганизациям Тогда
			СтруктураПоиска = Новый Структура("Пользователь, Организация, Подразделение", ТекущиеДанные.Пользователь, ТекущиеДанные.Организация, ТекущиеДанные.Подразделение);
			ШаблонСообщения = НСтр("ru = 'Обнаружены повторяющиеся поля ""Пользователь"", ""Организация"" и ""Подразделение"" ""(%1, %2, %3)"" в таблице ""Оповещаемые лица""!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущиеДанные.Пользователь, ?(ЗначениеЗаполнено(ТекущиеДанные.Организация), ТекущиеДанные.Организация, "<все организации>"), ?(ЗначениеЗаполнено(ТекущиеДанные.Подразделение), ТекущиеДанные.Подразделение, "<все подразделения>"));
		ИначеЕсли Объект.РазделятьПолучателейПоОрганизациям Тогда
			СтруктураПоиска = Новый Структура("Пользователь, Организация", ТекущиеДанные.Пользователь, ТекущиеДанные.Организация);
			ШаблонСообщения = НСтр("ru = 'Обнаружены повторяющиеся поля ""Пользователь"" и ""Организация"" ""(%1 и %2)"" в таблице ""Оповещаемые лица""!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущиеДанные.Пользователь, ?(ЗначениеЗаполнено(ТекущиеДанные.Организация), ТекущиеДанные.Организация, "<все организации>"));
		ИначеЕсли Объект.РазделятьПолучателейПоПодразделениям Тогда
			СтруктураПоиска = Новый Структура("Пользователь, Подразделение", ТекущиеДанные.Пользователь, ТекущиеДанные.Подразделение);
			ШаблонСообщения = НСтр("ru = 'Обнаружены повторяющиеся поля ""Пользователь"" и ""Подразделение"" ""(%1 и %2)"" в таблице ""Оповещаемые лица""!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущиеДанные.Пользователь, ?(ЗначениеЗаполнено(ТекущиеДанные.Подразделение), ТекущиеДанные.Подразделение, "<все подразделения>"));
		Иначе
			СтруктураПоиска = Новый Структура("Пользователь", ТекущиеДанные.Пользователь);
			ШаблонСообщения = НСтр("ru = 'Обнаружены повторяющиеся поля ""Пользователь"" ""(%1)"" в таблице ""Оповещаемые лица""!'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущиеДанные.Пользователь);
		КонецЕсли;
		
		НайденныеСтроки = Объект.Оповещаемые.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 1 Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Оповещаемые",, Отказ);		
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	// ТЧ Пользователи
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазделятьПолучателейПоПодразделениямПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделятьПолучателейПоОрганизациямПриИзменении(Элемент)

	УправлениеФормой();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОповещаемые

&НаКлиенте
Процедура ОповещаемыеПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Оповещаемые.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ТипЗнч(ТекущиеДанные.Пользователь) <> Тип("СправочникСсылка.Пользователи") Тогда
		ВыбратьТипПолучателя();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещаемыеПользовательОчистка(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Оповещаемые.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
	    Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Пользователь = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.ОповещаемыеПодразделение.Видимость = Объект.РазделятьПолучателейПоПодразделениям;
	Элементы.ОповещаемыеОрганизация.Видимость = Объект.РазделятьПолучателейПоОрганизациям;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипПолучателя()
	
	СписокДоступныхТипов = Новый СписокЗначений;
	
	СписокДоступныхТипов.Добавить("Пользователи");
	СписокДоступныхТипов.Добавить("Ответственный по документу");
	СписокДоступныхТипов.Добавить("Сотрудники бригады-исполнителя");
	
	Если торо_РаботаССогласованиями.ПроверитьИспользованиеСогласованияДокументов() Тогда
		
		СписокДоступныхТипов.Добавить("Согласующие");
		СписокДоступныхТипов.Добавить("Оповещаемые");
		
	КонецЕсли;
	
	СписокДоступныхТипов.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ВыбратьТипПолучателяЗавершение", ЭтотОбъект), НСтр("ru = 'Кому формировать уведомления'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипПолучателяЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    ВыбранныйТип = ВыбранныйЭлемент;
    
	Если ВыбранныйТип <> Неопределено Тогда
		Если ВыбранныйТип.Значение = "Пользователи" Тогда
            Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
        Иначе
            Элементы.Оповещаемые.ТекущиеДанные.Пользователь = ВыбранныйТип;
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти
